{"from": {"secList": ["sec-time-values-and-time-range"], "secData": {"sec-time-values-and-time-range": {"num": "20.4.1.1", "title": "#sec-time-values-and-time-range Time Values and Time Range", "html": "<emu-clause id=\"sec-time-values-and-time-range\">\n        <h1><span class=\"secnum excluded-secnum\" excluded-id=\"sec-time-values-and-time-range\">#sec-time-values-and-time-range</span> Time Values and Time Range</h1>\n        <p>A Date object contains a Number representing an instant in time with millisecond precision. Such a Number is called a <dfn>time value</dfn>. A time value may also be *NaN*, indicating that the Date object does not represent a specific instant in time.</p>\n        <p>Time is measured in ECMAScript as milliseconds since midnight at the beginning of 01 January, 1970 UTC. Time in ECMAScript does not observe leap seconds; they are ignored. Time calculations assume each and every day contains exactly <emu-eqn class=\"inline\">60 &#215; 60 &#215; 24 &#215; 1000 = 86,400,000</emu-eqn> milliseconds, to align with the POSIX specification of each and every day containing exactly 86,400 seconds.</p>\n        <p>A Number can exactly represent all integers from -9,007,199,254,740,992 to 9,007,199,254,740,992 (<emu-xref href=\"#sec-number.min_safe_integer\"><a href=\"#sec-number.min_safe_integer\" class=\"excluded-xref\" excluded-id=\"sec-number.min_safe_integer\">#sec-number.min_safe_integer</a></emu-xref> and <emu-xref href=\"#sec-number.max_safe_integer\"><a href=\"#sec-number.max_safe_integer\" class=\"excluded-xref\" excluded-id=\"sec-number.max_safe_integer\">#sec-number.max_safe_integer</a></emu-xref>). A time value supports a slightly smaller range of exactly -100,000,000 days to 100,000,000 days measured relative to midnight at the beginning of 01 January, 1970 UTC. This yields an exact supported time value range of -8,640,000,000,000,000 to 8,640,000,000,000,000 milliseconds relative to midnight at the beginning of 01 January, 1970 UTC.</p>\n        <p>The exact moment of midnight at the beginning of 01 January, 1970 UTC is represented by the time value *+0*.</p>\n        <emu-note><span class=\"note\">Note</span><div class=\"note-contents\">\n          <p>The 400 year cycle of the Gregorian calendar contains 97 leap years. This yields an average of 365.2425 days per year, or an average of 31,556,952,000 milliseconds per year under the Gregorian calendar. ECMAScript applies a proleptic Gregorian calendar for all time computations.</p>\n          <p>As specified by this section, the maximum year range a Number can represent exactly with millisecond precision is approximately -285,426 to 285,426 years relative to midnight at the beginning of 01 January, 1970 UTC.</p>\n          <p>As specified by this section, the maximum year range a time value can represent is approximately -273,790 to 273,790 years relative to midnight at the beginning of 01 January, 1970 UTC.</p>\n        </div></emu-note>\n      </emu-clause>\n\n      "}}, "figData": {}}, "to": {"secList": ["sec-time-values-and-time-range"], "secData": {"sec-time-values-and-time-range": {"num": "20.4.1.1", "title": "#sec-time-values-and-time-range Time Values and Time Range", "html": "<emu-clause id=\"sec-time-values-and-time-range\">\n        <h1><span class=\"secnum excluded-secnum\" excluded-id=\"sec-time-values-and-time-range\">#sec-time-values-and-time-range</span> Time Values and Time Range</h1>\n        <p>Time measurement in ECMAScript is analogous to time measurement in POSIX, in particular sharing definition in terms of the proleptic Gregorian calendar, an epoch of midnight at the beginning of 01 January, 1970 UTC, and an accounting of every day as comprising exactly 86,400 seconds (each of which is 1000 milliseconds long).</p>\n        <p>An ECMAScript <dfn>time value</dfn> is a Number, either a finite <emu-xref href=\"#integer\"><a href=\"#integer\">integer</a></emu-xref> representing an instant in time to millisecond precision or *NaN* representing no specific instant. A time value that is a multiple of <emu-eqn class=\"inline\">24 &#215; 60 &#215; 60 &#215; 1000 = 86,400,000</emu-eqn> (i.e., is equal to 86,400,000 &#215; _d_ for some <emu-xref href=\"#integer\"><a href=\"#integer\">integer</a></emu-xref> _d_) represents the instant at the start of the UTC day that follows the epoch by _d_ whole UTC days (preceding the epoch for negative _d_). Every other finite time value _t_ is defined relative to the greatest preceding time value _s_ that is such a multiple, and represents the instant that occurs within the same UTC day as _s_ but follows it by _t_ &#8722; _s_ milliseconds.</p>\n        <p>Time values do not account for UTC leap seconds&#8212;there are no time values representing instants within positive leap seconds, and there are time values representing instants removed from the UTC timeline by negative leap seconds. However, the definition of time values nonetheless yields piecewise alignment with UTC, with discontinuities only at leap second boundaries and zero difference outside of leap seconds.</p>\n        <p>A Number can exactly represent all integers from -9,007,199,254,740,992 to 9,007,199,254,740,992 (<emu-xref href=\"#sec-number.min_safe_integer\"><a href=\"#sec-number.min_safe_integer\" class=\"excluded-xref\" excluded-id=\"sec-number.min_safe_integer\">#sec-number.min_safe_integer</a></emu-xref> and <emu-xref href=\"#sec-number.max_safe_integer\"><a href=\"#sec-number.max_safe_integer\" class=\"excluded-xref\" excluded-id=\"sec-number.max_safe_integer\">#sec-number.max_safe_integer</a></emu-xref>). A time value supports a slightly smaller range of -8,640,000,000,000,000 to 8,640,000,000,000,000 milliseconds. This yields a supported time value range of exactly -100,000,000 days to 100,000,000 days relative to midnight at the beginning of 01 January, 1970 UTC.</p>\n        <p>The exact moment of midnight at the beginning of 01 January, 1970 UTC is represented by the time value *+0*.</p>\n        <emu-note><span class=\"note\">Note</span><div class=\"note-contents\">\n          <p>The 400 year cycle of the proleptic Gregorian calendar contains 97 leap years. This yields an average of 365.2425 days per year, which is 31,556,952,000 milliseconds. Therefore, the maximum range a Number could represent exactly with millisecond precision is approximately -285,426 to 285,426 years relative to 1970. The smaller range supported by a time value as specified in this section is approximately -273,790 to 273,790 years relative to 1970.</p>\n        </div></emu-note>\n      </emu-clause>\n\n      "}}, "figData": {}}}